lilindian16/RE_SWC_FW/lib/ch32_usbd/src/ch32x035_usbd.c
#include "ch32x035_usbd.h"
#include "Arduino.h"

/*******************************************************************************/
/* Variable Definition */
/* Global */
const uint8_t *pUSBFS_Descr;

/* Setup Request */
volatile uint8_t  USBFS_SetupReqCode;
volatile uint8_t  USBFS_SetupReqType;
volatile uint16_t USBFS_SetupReqValue;
volatile uint16_t USBFS_SetupReqIndex;
volatile uint16_t USBFS_SetupReqLen;

/* USB Device Status */
volatile uint8_t USBFS_DevConfig;
volatile uint8_t USBFS_DevAddr;
volatile uint8_t USBFS_DevSleepStatus;
volatile uint8_t USBFS_DevEnumStatus;

/* HID Class Command */
volatile uint8_t USBFS_HidIdle[2];
volatile uint8_t USBFS_HidProtocol[2];

volatile bool endpoint_rx_pending[DEF_UEP_NUM] = {false};

#define DEF_USBD_UEP0_SIZE  64
#define DEF_USB_EP1_FS_SIZE 64     // Endpoint 1 is used for HID report
#define DEF_USB_EP2_FS_SIZE 64 * 2 // Endpoint 2 is used for TX and RX comms

Descriptor_Configs_t *descriptor_config_ptr;
USB_Device_Mode_t     current_device_mode;

/**
 * Endpoint configuration:
 * Endpoint 0: config (required)
 * Endpoint 1: USB HID SWC mode (HID report)
 * Endpoint 2: bootloader comms (tx and rx)
 */

/* Endpoint Buffer */
__attribute__((aligned(4))) uint8_t USBFS_EP0_4Buf[DEF_USBD_UEP0_SIZE];
__attribute__((aligned(4))) uint8_t USBFS_EP1_Buf[DEF_USB_EP1_FS_SIZE];
__attribute__((aligned(4))) uint8_t USBFS_EP2_Buf[DEF_USB_EP2_FS_SIZE];
__attribute__((aligned(4))) uint8_t USBFS_EP3_Buf[DEF_USB_EP2_FS_SIZE];
__attribute__((aligned(4))) uint8_t USBFS_EP4_Buf[DEF_USB_EP2_FS_SIZE];
__attribute__((aligned(4))) uint8_t USBFS_EP5_Buf[DEF_USB_EP2_FS_SIZE];
__attribute__((aligned(4))) uint8_t USBFS_EP6_Buf[DEF_USB_EP2_FS_SIZE];
__attribute__((aligned(4))) uint8_t USBFS_EP7_Buf[DEF_USB_EP2_FS_SIZE];

/* USB IN Endpoint Busy Flag */
volatile uint8_t USBFS_Endp_Busy[DEF_UEP_NUM];

/******************************************************************************/
/* Interrupt Service Routine Declaration*/
void USBFS_IRQHandler(void) __attribute__((interrupt("WCH-Interrupt-fast")));

/*********************************************************************
 * @fn      USBFS_RCC_Init
 *
 * @brief   Initializes the USBFS clock configuration.
 *
 * @return  none
 */
void USBFS_RCC_Init(void) {
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_AFIO, ENABLE);
  RCC_AHBPeriphClockCmd(RCC_AHBPeriph_USBFS, ENABLE);
}

/*********************************************************************
 * @fn      USBFS_Device_Endp_Init
 *
 * @brief   Initializes USB device endpoints.
 *
 * @return  none
 */
void USBFS_Device_Endp_Init(void) {

  /* Config endpoint 0 */
  USBFSD->UEP0_DMA    = (uint32_t)USBFS_EP0_4Buf;
  USBFSD->UEP0_CTRL_H = USBFS_UEP_R_RES_ACK | USBFS_UEP_T_RES_NAK;

  /* Config endpoint 1 (USB HID mode) */
  USBFSD->UEP4_1_MOD  = USBFS_UEP1_TX_EN;
  USBFSD->UEP1_DMA    = (uint32_t)USBFS_EP1_Buf;
  USBFSD->UEP1_CTRL_H = USBFS_UEP_T_RES_NAK;
  USBFSD->UEP1_TX_LEN = 0;

  /* Config endpoint 2 (bootloader TX RX) */
  USBFSD->UEP2_3_MOD  = (USBFS_UEP2_RX_EN | USBFS_UEP2_TX_EN);
  USBFSD->UEP2_DMA    = (uint32_t)USBFS_EP2_Buf;
  USBFSD->UEP2_CTRL_H = USBFS_UEP_R_RES_ACK;
  USBFSD->UEP2_TX_LEN = 0;

  /* Clear End-points Busy Status */
  for (uint8_t i = 0; i < DEF_UEP_NUM; i++) {
    USBFS_Endp_Busy[i]     = 0;
    endpoint_rx_pending[i] = false;
  }
}

/*********************************************************************
 * @fn      GPIO_USB_INIT
 *
 * @brief   Initializes USB GPIO.
 *
 * @return  none
 */
void GPIO_USB_INIT(void) {
  GPIO_InitTypeDef GPIO_InitStructure = {0};

  RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOC, ENABLE);
  GPIO_InitStructure.GPIO_Pin  = GPIO_Pin_16;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
  GPIO_Init(GPIOC, &GPIO_InitStructure);

  GPIO_InitStructure.GPIO_Pin  = GPIO_Pin_17;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
  GPIO_Init(GPIOC, &GPIO_InitStructure);
}

/*********************************************************************
 * @fn      USB_Sleep_Wakeup_CFG
 *
 * @brief   Configure USB wake up mode
 *
 * @return  none
 */
void USB_Sleep_Wakeup_CFG(void) {
  EXTI_InitTypeDef EXTI_InitStructure = {0};

  EXTI_InitStructure.EXTI_Line    = EXTI_Line28;
  EXTI_InitStructure.EXTI_Mode    = EXTI_Mode_Event;
  EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Rising;
  EXTI_InitStructure.EXTI_LineCmd = ENABLE;
  EXTI_Init(&EXTI_InitStructure);
}

/*********************************************************************
 * @fn      USBFS_Device_Init
 *
 * @brief   Initializes USB device.
 *
 * @return  none
 */
void USBFS_Device_Init(FunctionalState       sta,
                       Descriptor_Configs_t *descriptor_config,
                       USB_Device_Mode_t     device_mode) {
  descriptor_config_ptr = descriptor_config;
  current_device_mode   = device_mode;
  if (sta) {
    NVIC_DisableIRQ(USBFS_IRQn); // Make sure interrupt is disabled
    GPIO_USB_INIT();
    AFIO->CTLR = (AFIO->CTLR & ~(UDP_PUE_MASK | UDM_PUE_MASK)) | USB_PHY_V33 |
                 UDP_PUE_1K5 | USB_IOEN;
    USBFSD->BASE_CTRL = 0x00;
    USBFS_Device_Endp_Init();
    USBFSD->DEV_ADDR = 0x00;
    USBFSD->BASE_CTRL =
        USBFS_UC_DEV_PU_EN | USBFS_UC_INT_BUSY | USBFS_UC_DMA_EN;
    USBFSD->INT_FG    = 0xff;
    USBFSD->UDEV_CTRL = USBFS_UD_PD_DIS | USBFS_UD_PORT_EN;
    USBFSD->INT_EN = USBFS_UIE_SUSPEND | USBFS_UIE_BUS_RST | USBFS_UIE_TRANSFER;
    NVIC_EnableIRQ(USBFS_IRQn);
  } else {
    AFIO->CTLR        = AFIO->CTLR & ~(UDP_PUE_MASK | UDM_PUE_MASK | USB_IOEN);
    USBFSD->BASE_CTRL = USBFS_UC_RESET_SIE | USBFS_UC_CLR_ALL;
    delayMicroseconds(10); // Don't use WCH delay implementation as that
                           // resets Arduino millis
    USBFSD->BASE_CTRL = 0x00;
    NVIC_DisableIRQ(USBFS_IRQn);
  }
}

/*********************************************************************
 * @fn      USBFS_Send_Resume
 *
 * @brief   USBFS device sends wake-up signal to host
 *
 * @return  none
 */
void USBFS_Send_Resume(void) {
  GPIOC->BSXR  = 0x00020001;
  GPIOC->CFGXR = (GPIOC->CFGXR & ~0x000000FF) | 0x00000088;
  AFIO->CTLR   = (AFIO->CTLR & ~UDP_PUE_1K5) | UDM_PUE_1K5;
  delay(8);
  AFIO->CTLR   = (AFIO->CTLR & ~UDM_PUE_1K5) | UDP_PUE_1K5;
  GPIOC->CFGXR = (GPIOC->CFGXR & ~0x000000FF) | 0x00000084;
  GPIOC->BSXR  = 0x00010002;
}

/*********************************************************************
 * @fn      MCU_Sleep_Wakeup_Operate
 *
 * @brief   Perform sleep operation
 *
 * @return  none
 */
void MCU_Sleep_Wakeup_Operate(void) {
  // printf("Sleep\r\n");
  __disable_irq();
  EXTI_ClearFlag(EXTI_Line12 | EXTI_Line13 | EXTI_Line14 | EXTI_Line15);
  EXTI_ClearFlag(EXTI_Line4 | EXTI_Line5 | EXTI_Line6 | EXTI_Line7);

  PWR_EnterSTOPMode(PWR_STOPEntry_WFE);
  SystemInit();
  SystemCoreClockUpdate();
  USBFS_RCC_Init();

