lilindian16/RE_SWC_FW/lib/ch32_usbd/src/ch32x035_usbd.c
  if (EXTI_GetFlagStatus(EXTI_Line12 | EXTI_Line13 | EXTI_Line14 |
                         EXTI_Line15) != RESET) {
    EXTI_ClearFlag(EXTI_Line12 | EXTI_Line13 | EXTI_Line14 | EXTI_Line15);
    USBFS_Send_Resume();
  } else if (EXTI_GetFlagStatus(EXTI_Line4 | EXTI_Line5 | EXTI_Line6 |
                                EXTI_Line7) != RESET) {
    EXTI_ClearFlag(EXTI_Line4 | EXTI_Line5 | EXTI_Line6 | EXTI_Line7);
    USBFS_Send_Resume();
  }
  __enable_irq();
  // printf("Wake\r\n");
}

/*********************************************************************
 * @fn      USBFS_Endp_DataUp
 *
 * @brief   USBFS device data upload
 *
 * @return  none
 */
uint8_t USBFS_Endp_DataUp(uint8_t endp, uint8_t *pbuf, uint16_t len,
                          uint8_t mod) {
  uint8_t   endp_mode;
  uint8_t   buf_load_offset;
  uint16_t *uep_tx_len;
  uint16_t *uep_ctrl;
  uint8_t  *uep_dma;

  switch (endp) {
  case 1:
    uep_tx_len = (uint16_t *)&USBFSD->UEP1_TX_LEN;
    uep_ctrl   = (uint16_t *)&USBFSD->UEP1_CTRL_H;
    uep_dma    = (uint8_t *)&USBFSD->UEP1_DMA;
    break;
  case 2:
    uep_tx_len = (uint16_t *)&USBFSD->UEP2_TX_LEN;
    uep_ctrl   = (uint16_t *)&USBFSD->UEP2_CTRL_H;
    uep_dma    = (uint8_t *)&USBFSD->UEP2_DMA;
    break;
  case 3:
    uep_tx_len = (uint16_t *)&USBFSD->UEP3_TX_LEN;
    uep_ctrl   = (uint16_t *)&USBFSD->UEP3_CTRL_H;
    uep_dma    = (uint8_t *)&USBFSD->UEP3_DMA;
    break;
  case 4:
    uep_tx_len = (uint16_t *)&USBFSD->UEP4_TX_LEN;
    uep_ctrl   = (uint16_t *)&USBFSD->UEP4_CTRL_H;
    uep_dma    = (uint8_t *)&USBFSD->UEP0_DMA;
    break;
  case 5:
    uep_tx_len = (uint16_t *)&USBFSD->UEP5_TX_LEN;
    uep_ctrl   = (uint16_t *)&USBFSD->UEP5_CTRL_H;
    uep_dma    = (uint8_t *)&USBFSD->UEP5_DMA;
    break;
  case 6:
    uep_tx_len = (uint16_t *)&USBFSD->UEP6_TX_LEN;
    uep_ctrl   = (uint16_t *)&USBFSD->UEP6_CTRL_H;
    uep_dma    = (uint8_t *)&USBFSD->UEP6_DMA;
    break;
  case 7:
    uep_tx_len = (uint16_t *)&USBFSD->UEP7_TX_LEN;
    uep_ctrl   = (uint16_t *)&USBFSD->UEP7_CTRL_H;
    uep_dma    = (uint8_t *)&USBFSD->UEP7_DMA;
    break;
  default:
    break;
  }

  /* DMA config, endp_ctrl config, endp_len config */
  if ((endp >= DEF_UEP1) && (endp <= DEF_UEP7)) {
    if (USBFS_Endp_Busy[endp] == 0) {
      if ((endp == DEF_UEP1) || (endp == DEF_UEP4)) {
        /* endp1/endp4 */
        endp_mode = USBFSD->UEP4_1_MOD;
        if (endp == DEF_UEP1) {
          endp_mode = (uint8_t)(endp_mode >> 4);
        }
      } else if ((endp == DEF_UEP2) || (endp == DEF_UEP3)) {
        /* endp2/endp3 */
        endp_mode = USBFSD->UEP2_3_MOD;
        if (endp == DEF_UEP3) {
          endp_mode = (uint8_t)(endp_mode >> 4);
        }
      } else {
        /* endp5/endp6/endp7 */
        endp_mode = USBFSD->UEP567_MOD;
        if (endp == DEF_UEP5) {
          endp_mode = (uint8_t)(endp_mode << 2);
        } else if (endp == DEF_UEP7) {
          endp_mode = (uint8_t)(endp_mode >> 2);
        }

        endp_mode &= 0xfe;
      }

      if (endp_mode & USBFSD_UEP_TX_EN) {
        if (endp_mode & USBFSD_UEP_RX_EN) {
          if (endp_mode & USBFSD_UEP_BUF_MOD) {
            if (*uep_ctrl & USBFS_UEP_T_TOG) {
              buf_load_offset = 192;
            } else {
              buf_load_offset = 128;
            }
          } else {
            buf_load_offset = 64;
          }
        } else {
          if (endp_mode & USBFSD_UEP_BUF_MOD) {
            /* double tx buffer */
            if (*uep_ctrl & USBFS_UEP_T_TOG) {
              buf_load_offset = 64;
            } else {
              buf_load_offset = 0;
            }
          } else {
            buf_load_offset = 0;
          }
        }

        if (endp == DEF_UEP4) {
          buf_load_offset += 64;
        }

        if (buf_load_offset == 0) {
          if (mod == DEF_UEP_DMA_LOAD) {
            /* DMA mode */
            *uep_dma = (uint16_t)(uint32_t)pbuf;
          } else {
            /* copy mode */
            memcpy(
                ((uint8_t *)(*((volatile uint32_t *)(uep_dma))) + 0x20000000),
                pbuf, len);
          }
        } else {
          memcpy(((uint8_t *)(*((volatile uint32_t *)(uep_dma))) + 0x20000000) +
                     buf_load_offset,
                 pbuf, len);
        }
        /* tx length */
        *uep_tx_len = len;
        /* response ack */
        *uep_ctrl = (*uep_ctrl & ~USBFS_UEP_T_RES_MASK) | USBFS_UEP_T_RES_ACK;

        /* Set end-point busy */
        USBFS_Endp_Busy[endp] = 0x01;
      } else {
        return 1;
      }
    } else {
      return 1;
    }
  } else {
    return 1;
  }
  return 0;
}

/*********************************************************************
 * @fn      USBFS_IRQHandler
 *
 * @brief   This function handles HD-FS exception.
 *
 * @return  none
 */
void USBFS_IRQHandler(void) {

  uint8_t  intflag, intst, errflag;
  uint16_t len;

  intflag = USBFSD->INT_FG;
  intst   = USBFSD->INT_ST;

  switch (current_device_mode) {
  case USB_DEVICE_MODE_BOOTLOADER:
    if (intflag & USBFS_UIF_TRANSFER) {
      switch (intst & USBFS_UIS_TOKEN_MASK) {
      /* data-in stage processing */
      case USBFS_UIS_TOKEN_IN:
        switch (intst & (USBFS_UIS_TOKEN_MASK | USBFS_UIS_ENDP_MASK)) {
        /* end-point 0 data in interrupt */
        case USBFS_UIS_TOKEN_IN | DEF_UEP0:
          if (USBFS_SetupReqLen == 0) {
            USBFSD->UEP0_CTRL_H =
                (USBFSD->UEP0_CTRL_H & ~USBFS_UEP_R_RES_MASK) |
                USBFS_UEP_R_TOG | USBFS_UEP_R_RES_ACK;
          }
          if ((USBFS_SetupReqType & USB_REQ_TYP_MASK) != USB_REQ_TYP_STANDARD) {
            /* Non-standard request endpoint 0 Data upload */
          } else {
            /* Standard request endpoint 0 Data upload */
            switch (USBFS_SetupReqCode) {
            case USB_GET_DESCRIPTOR:
              len = USBFS_SetupReqLen >= DEF_USBD_UEP0_SIZE ? DEF_USBD_UEP0_SIZE
                                                            : USBFS_SetupReqLen;
              memcpy(USBFS_EP0_4Buf, pUSBFS_Descr, len);
              USBFS_SetupReqLen -= len;
              pUSBFS_Descr += len;
              USBFSD->UEP0_TX_LEN = len;
              USBFSD->UEP0_CTRL_H ^= USBFS_UEP_T_TOG;
              break;

            case USB_SET_ADDRESS:
              USBFSD->DEV_ADDR =
                  (USBFSD->DEV_ADDR & USBFS_UDA_GP_BIT) | USBFS_DevAddr;
              break;

            default:
              break;
            }
          }
          break;

        case (USBFS_UIS_TOKEN_IN | DEF_UEP2):
          USBFSD->UEP2_CTRL_H ^= USBFS_UEP_T_TOG;
          USBFSD->UEP2_CTRL_H = (USBFSD->UEP2_CTRL_H & ~USBFS_UEP_T_RES_MASK) |
                                USBFS_UEP_T_RES_NAK;
          USBFS_Endp_Busy[DEF_UEP2] = 0;
          break;

        default:
          break;
        }
        break;

      /* data-out stage processing */
      case USBFS_UIS_TOKEN_OUT:
        switch (intst & (USBFS_UIS_TOKEN_MASK | USBFS_UIS_ENDP_MASK)) {
        /* end-point 0 data out interrupt */
        case USBFS_UIS_TOKEN_OUT | DEF_UEP0:
          len = USBFSD->RX_LEN;
          if (intst & USBFS_UIS_TOG_OK) {
            if ((USBFS_SetupReqType & USB_REQ_TYP_MASK) !=
                USB_REQ_TYP_STANDARD) {
              /* Non-standard request end-point 0 Data download */
              USBFS_SetupReqLen = 0;
              /* Non-standard request end-point 0 Data download */
              if (USBFS_SetupReqCode == CDC_SET_LINE_CODING) {
              }
            } else {
              /* Standard request end-point 0 Data download */
              /* Add your code here */
            }
            if (USBFS_SetupReqLen == 0) {
              USBFSD->UEP0_TX_LEN = 0;
              USBFSD->UEP0_CTRL_H =
                  (USBFSD->UEP0_CTRL_H & ~USBFS_UEP_T_RES_MASK) |
                  USBFS_UEP_T_TOG | USBFS_UEP_T_RES_ACK;
            }
          }
          break;

