lilindian16/RE_SWC_FW/lib/ch32_usbd/src/ch32x035_usbd.c
        /* end-point 2 data out interrupt */
        case (USBFS_UIS_TOKEN_OUT | DEF_UEP2):
          len = USBFSD->RX_LEN;
          if (len <= sizeof(USBFS_EP2_Buf) / 2) {
            endpoint_rx_pending[2] = true;
            USBFSD->UEP2_CTRL_H ^= USBFS_UEP_R_TOG;
          }

          break;

        default:
          break;
        }
        break;

      /* Setup stage processing */
      case USBFS_UIS_TOKEN_SETUP:
        USBFSD->UEP0_CTRL_H = USBFS_UEP_T_TOG | USBFS_UEP_T_RES_NAK |
                              USBFS_UEP_R_TOG | USBFS_UEP_R_RES_NAK;

        /* Store All Setup Values */
        USBFS_SetupReqType  = pUSBFS_SetupReqPak->bRequestType;
        USBFS_SetupReqCode  = pUSBFS_SetupReqPak->bRequest;
        USBFS_SetupReqLen   = pUSBFS_SetupReqPak->wLength;
        USBFS_SetupReqValue = pUSBFS_SetupReqPak->wValue;
        USBFS_SetupReqIndex = pUSBFS_SetupReqPak->wIndex;
        len                 = 0;
        errflag             = 0;
        if ((USBFS_SetupReqType & USB_REQ_TYP_MASK) != USB_REQ_TYP_STANDARD) {
          /* usb non-standard request processing */
          if (USBFS_SetupReqType & USB_REQ_TYP_CLASS) {
            /* Class requests */
          } else if (USBFS_SetupReqType & USB_REQ_TYP_VENDOR) {
            /* Manufacturer request */
          } else {
            errflag = 0xFF;
          }

          /* Copy Descriptors to Endp0 DMA buffer */
          len = (USBFS_SetupReqLen >= DEF_USBD_UEP0_SIZE) ? DEF_USBD_UEP0_SIZE
                                                          : USBFS_SetupReqLen;
          memcpy(USBFS_EP0_4Buf, pUSBFS_Descr, len);
          pUSBFS_Descr += len;
        } else {
          /* usb standard request processing */
          switch (USBFS_SetupReqCode) {
          /* get device/configuration/string/report/... descriptors */
          case USB_GET_DESCRIPTOR:
            switch ((uint8_t)(USBFS_SetupReqValue >> 8)) {
            /* get usb device descriptor */
            case USB_DESCR_TYP_DEVICE:
              pUSBFS_Descr = descriptor_config_ptr->device_descriptor;
              len          = descriptor_config_ptr->device_descriptor[0];
              break;

            /* get usb configuration descriptor */
            case USB_DESCR_TYP_CONFIG:
              pUSBFS_Descr = descriptor_config_ptr->config_descriptor;
              len = ((uint16_t)descriptor_config_ptr->config_descriptor[2] +
                     ((uint16_t)descriptor_config_ptr->config_descriptor[3]
                      << 8));
              break;

            /* get usb string descriptor */
            case USB_DESCR_TYP_STRING:
              switch ((uint8_t)(USBFS_SetupReqValue & 0xFF)) {
              /* Descriptor 0, Language descriptor */
              case DEF_STRING_DESC_LANG:
                pUSBFS_Descr = descriptor_config_ptr->language_descriptor;
                len          = descriptor_config_ptr->language_descriptor[0];
                break;

              /* Descriptor 1, Manufacturers String descriptor */
              case DEF_STRING_DESC_MANU:
                pUSBFS_Descr = descriptor_config_ptr->manufacturer_descriptor;
                len = descriptor_config_ptr->manufacturer_descriptor[0];
                break;

              /* Descriptor 2, Product String descriptor */
              case DEF_STRING_DESC_PROD:
                pUSBFS_Descr = descriptor_config_ptr->prod_info_descriptor;
                len          = descriptor_config_ptr->prod_info_descriptor[0];
                break;

              /* Descriptor 3, Serial-number String descriptor */
              case DEF_STRING_DESC_SERN:
                pUSBFS_Descr =
                    descriptor_config_ptr->serial_num_info_descriptor;
                len = descriptor_config_ptr->serial_num_info_descriptor[0];
                break;

              default:
                errflag = 0xFF;
                break;
              }
              break;

            default:
              errflag = 0xFF;
              break;
            }

            /* Copy Descriptors to Endp0 DMA buffer */
            if (USBFS_SetupReqLen > len) {
              USBFS_SetupReqLen = len;
            }
            len = (USBFS_SetupReqLen >= DEF_USBD_UEP0_SIZE) ? DEF_USBD_UEP0_SIZE
                                                            : USBFS_SetupReqLen;
            memcpy(USBFS_EP0_4Buf, pUSBFS_Descr, len);
            pUSBFS_Descr += len;
            break;

          /* Set usb address */
          case USB_SET_ADDRESS:
            USBFS_DevAddr = (uint8_t)(USBFS_SetupReqValue & 0xFF);
            break;

          /* Get usb configuration now set */
          case USB_GET_CONFIGURATION:
            USBFS_EP0_4Buf[0] = USBFS_DevConfig;
            if (USBFS_SetupReqLen > 1) {
              USBFS_SetupReqLen = 1;
            }
            break;

          /* Set usb configuration to use */
          case USB_SET_CONFIGURATION:
            USBFS_DevConfig     = (uint8_t)(USBFS_SetupReqValue & 0xFF);
            USBFS_DevEnumStatus = 0x01;
            break;

          /* Clear or disable one usb feature */
          case USB_CLEAR_FEATURE:
            if ((USBFS_SetupReqType & USB_REQ_RECIP_MASK) ==
                USB_REQ_RECIP_DEVICE) {
              /* clear one device feature */
              if ((uint8_t)(USBFS_SetupReqValue & 0xFF) ==
                  USB_REQ_FEAT_REMOTE_WAKEUP) {
                /* clear usb sleep status, device not prepare to sleep */
                USBFS_DevSleepStatus &= ~0x01;
              }
            } else if ((USBFS_SetupReqType & USB_REQ_RECIP_MASK) ==
                       USB_REQ_RECIP_ENDP) {
              /* Clear End-point Feature */
              if ((uint8_t)(USBFS_SetupReqValue & 0xFF) ==
                  USB_REQ_FEAT_ENDP_HALT) {
                switch ((uint8_t)(USBFS_SetupReqIndex & 0xFF)) {
                case (DEF_UEP_IN | DEF_UEP1):
                  /* Set End-point 1 IN NAK */
                  USBFSD->UEP1_CTRL_H = USBFS_UEP_T_RES_NAK;
                  break;

                case (DEF_UEP_OUT | DEF_UEP2):
                  /* Set End-point 2 OUT ACK */
                  USBFSD->UEP2_CTRL_H = USBFS_UEP_R_RES_ACK;
                  break;

                case (DEF_UEP_IN | DEF_UEP3):
                  /* Set End-point 3 IN NAK */
                  USBFSD->UEP3_CTRL_H = USBFS_UEP_T_RES_NAK;
                  break;

                default:
                  errflag = 0xFF;
                  break;
                }
              } else {
                errflag = 0xFF;
              }
            } else {
              errflag = 0xFF;
            }
            break;

          /* set or enable one usb feature */
          case USB_SET_FEATURE:
            if ((USBFS_SetupReqType & USB_REQ_RECIP_MASK) ==
                USB_REQ_RECIP_DEVICE) {
              /* Set Device Feature */
              if ((uint8_t)(USBFS_SetupReqValue & 0xFF) ==
                  USB_REQ_FEAT_REMOTE_WAKEUP) {
                if (descriptor_config_ptr->config_descriptor[7] & 0x20) {
                  /* Set Wake-up flag, device prepare to sleep */
                  USBFS_DevSleepStatus |= 0x01;
                } else {
                  errflag = 0xFF;
                }
              } else {
                errflag = 0xFF;
              }
            } else if ((USBFS_SetupReqType & USB_REQ_RECIP_MASK) ==
                       USB_REQ_RECIP_ENDP) {
              /* Set End-point Feature */
              if ((uint8_t)(USBFS_SetupReqValue & 0xFF) ==
                  USB_REQ_FEAT_ENDP_HALT) {
                /* Set end-points status stall */
                switch ((uint8_t)(USBFS_SetupReqIndex & 0xFF)) {
                case (DEF_UEP_IN | DEF_UEP1):
                  /* Set End-point 1 IN STALL */
                  USBFSD->UEP1_CTRL_H =
                      (USBFSD->UEP1_CTRL_H & ~USBFS_UEP_T_RES_MASK) |
                      USBFS_UEP_T_RES_STALL;
                  break;

                case (DEF_UEP_OUT | DEF_UEP2):
                  /* Set End-point 2 OUT STALL */
                  USBFSD->UEP2_CTRL_H =
                      (USBFSD->UEP2_CTRL_H & ~USBFS_UEP_R_RES_MASK) |
                      USBFS_UEP_R_RES_STALL;
                  break;

                case (DEF_UEP_IN | DEF_UEP3):
                  /* Set End-point 3 IN STALL */
                  USBFSD->UEP3_CTRL_H =
                      (USBFSD->UEP3_CTRL_H & ~USBFS_UEP_T_RES_MASK) |
                      USBFS_UEP_T_RES_STALL;
                  break;

                default:
                  errflag = 0xFF;
                  break;
                }
              } else {
                errflag = 0xFF;
              }
            } else {
              errflag = 0xFF;
            }
            break;

