lilindian16/RE_SWC_FW/lib/ch32_usbd/src/ch32x035_usbd.c
          /* This request allows the host to select another setting for the
           * specified interface  */
          case USB_GET_INTERFACE:
            USBFS_EP0_4Buf[0] = 0x00;
            if (USBFS_SetupReqLen > 1) {
              USBFS_SetupReqLen = 1;
            }
            break;

          case USB_SET_INTERFACE:
            break;

          /* host get status of specified device/interface/end-points */
          case USB_GET_STATUS:
            USBFS_EP0_4Buf[0] = 0x00;
            USBFS_EP0_4Buf[1] = 0x00;
            if ((USBFS_SetupReqType & USB_REQ_RECIP_MASK) ==
                USB_REQ_RECIP_DEVICE) {
              if (USBFS_DevSleepStatus & 0x01) {
                USBFS_EP0_4Buf[0] = 0x02;
              }
            } else if ((USBFS_SetupReqType & USB_REQ_RECIP_MASK) ==
                       USB_REQ_RECIP_ENDP) {
              switch ((uint8_t)(USBFS_SetupReqIndex & 0xFF)) {
              case (DEF_UEP_IN | DEF_UEP1):
                if (((USBFSD->UEP1_CTRL_H) & USBFS_UEP_T_RES_MASK) ==
                    USBFS_UEP_T_RES_STALL) {
                  USBFS_EP0_4Buf[0] = 0x01;
                }
                break;

              case (DEF_UEP_OUT | DEF_UEP2):
                if (((USBFSD->UEP2_CTRL_H) & USBFS_UEP_R_RES_MASK) ==
                    USBFS_UEP_R_RES_STALL) {
                  USBFS_EP0_4Buf[0] = 0x01;
                }
                break;

              case (DEF_UEP_IN | DEF_UEP3):
                if (((USBFSD->UEP3_CTRL_H) & USBFS_UEP_T_RES_MASK) ==
                    USBFS_UEP_T_RES_STALL) {
                  USBFS_EP0_4Buf[0] = 0x01;
                }
                break;

              default:
                errflag = 0xFF;
                break;
              }
            } else {
              errflag = 0xFF;
            }

            if (USBFS_SetupReqLen > 2) {
              USBFS_SetupReqLen = 2;
            }

            break;

          default:
            errflag = 0xFF;
            break;
          }
        }
        /* errflag = 0xFF means a request not support or some errors occurred,
         * else correct */
        if (errflag == 0xff) {
          /* if one request not support, return stall */
          USBFSD->UEP0_CTRL_H = USBFS_UEP_T_TOG | USBFS_UEP_T_RES_STALL |
                                USBFS_UEP_R_TOG | USBFS_UEP_R_RES_STALL;
        } else {
          /* end-point 0 data Tx/Rx */
          if (USBFS_SetupReqType & DEF_UEP_IN) {
            /* tx */
            len = (USBFS_SetupReqLen > DEF_USBD_UEP0_SIZE) ? DEF_USBD_UEP0_SIZE
                                                           : USBFS_SetupReqLen;
            USBFS_SetupReqLen -= len;
            USBFSD->UEP0_TX_LEN = len;
            USBFSD->UEP0_CTRL_H =
                (USBFSD->UEP0_CTRL_H & ~USBFS_UEP_T_RES_MASK) |
                USBFS_UEP_T_TOG | USBFS_UEP_T_RES_ACK;
          } else {
            /* rx */
            if (USBFS_SetupReqLen == 0) {
              USBFSD->UEP0_TX_LEN = 0;
              USBFSD->UEP0_CTRL_H =
                  (USBFSD->UEP0_CTRL_H & ~USBFS_UEP_T_RES_MASK) |
                  USBFS_UEP_T_TOG | USBFS_UEP_T_RES_ACK;
            } else {
              USBFSD->UEP0_CTRL_H =
                  (USBFSD->UEP0_CTRL_H & ~USBFS_UEP_R_RES_MASK) |
                  USBFS_UEP_R_TOG | USBFS_UEP_R_RES_ACK;
            }
          }
        }
        break;

      /* Sof pack processing */
      case USBFS_UIS_TOKEN_SOF:
        break;

      default:
        break;
      }
      USBFSD->INT_FG = USBFS_UIF_TRANSFER;
    } else if (intflag & USBFS_UIF_BUS_RST) {
      /* usb reset interrupt processing */
      USBFS_DevConfig      = 0;
      USBFS_DevAddr        = 0;
      USBFS_DevSleepStatus = 0;
      USBFS_DevEnumStatus  = 0;

      USBFSD->DEV_ADDR = 0;
      USBFS_Device_Endp_Init();
      USBFSD->INT_FG = USBFS_UIF_BUS_RST;
    } else if (intflag & USBFS_UIF_SUSPEND) {
      USBFSD->INT_FG = USBFS_UIF_SUSPEND;
      delayMicroseconds(10); // Don't use WCH delay implementation as that
                             // resets Arduino millis
      /* usb suspend interrupt processing */
      if (USBFSD->MIS_ST & USBFS_UMS_SUSPEND) {
        USBFS_DevSleepStatus |= 0x02;
        if (USBFS_DevSleepStatus == 0x03) {
          /* Handling usb sleep here */
        }
      } else {
        USBFS_DevSleepStatus &= ~0x02;
      }
    } else {
      /* other interrupts */
      USBFSD->INT_FG = intflag;
    }
    break;

  case USB_DEVICE_MODE_HID:
    if (intflag & USBFS_UIF_TRANSFER) {
      switch (intst & USBFS_UIS_TOKEN_MASK) {
      /* data-in stage processing */
      case USBFS_UIS_TOKEN_IN:
        switch (intst & (USBFS_UIS_TOKEN_MASK | USBFS_UIS_ENDP_MASK)) {
        /* end-point 0 data in interrupt */
        case USBFS_UIS_TOKEN_IN | DEF_UEP0:
          if (USBFS_SetupReqLen == 0) {
            USBFSD->UEP0_CTRL_H =
                (USBFSD->UEP0_CTRL_H & ~USBFS_UEP_R_RES_MASK) |
                USBFS_UEP_R_TOG | USBFS_UEP_R_RES_ACK;
          }

          if ((USBFS_SetupReqType & USB_REQ_TYP_MASK) != USB_REQ_TYP_STANDARD) {
            /* Non-standard request endpoint 0 Data upload */
          } else {
            switch (USBFS_SetupReqCode) {
            case USB_GET_DESCRIPTOR:
              len = USBFS_SetupReqLen >= DEF_USBD_UEP0_SIZE ? DEF_USBD_UEP0_SIZE
                                                            : USBFS_SetupReqLen;
              memcpy(USBFS_EP0_4Buf, pUSBFS_Descr, len);
              USBFS_SetupReqLen -= len;
              pUSBFS_Descr += len;
              USBFSD->UEP0_TX_LEN = len;
              USBFSD->UEP0_CTRL_H ^= USBFS_UEP_T_TOG;
              break;

            case USB_SET_ADDRESS:
              USBFSD->DEV_ADDR =
                  (USBFSD->DEV_ADDR & USBFS_UDA_GP_BIT) | USBFS_DevAddr;
              break;

            default:
              break;
            }
          }
          break;

        /* end-point 1 data in interrupt */
        case USBFS_UIS_TOKEN_IN | DEF_UEP1:
          USBFSD->UEP1_CTRL_H = (USBFSD->UEP1_CTRL_H & ~USBFS_UEP_T_RES_MASK) |
                                USBFS_UEP_T_RES_NAK;
          USBFSD->UEP1_CTRL_H ^= USBFS_UEP_T_TOG;
          USBFS_Endp_Busy[DEF_UEP1] = 0;
          break;

        /* end-point 2 data in interrupt */
        case USBFS_UIS_TOKEN_IN | DEF_UEP2:
          USBFSD->UEP2_CTRL_H = (USBFSD->UEP2_CTRL_H & ~USBFS_UEP_T_RES_MASK) |
                                USBFS_UEP_T_RES_NAK;
          USBFSD->UEP2_CTRL_H ^= USBFS_UEP_T_TOG;
          USBFS_Endp_Busy[DEF_UEP2] = 0;
          break;

        default:
          break;
        }
        break;

      /* data-out stage processing */
      case USBFS_UIS_TOKEN_OUT:
        switch (intst & (USBFS_UIS_TOKEN_MASK | USBFS_UIS_ENDP_MASK)) {
        /* end-point 0 data out interrupt */
        case USBFS_UIS_TOKEN_OUT | DEF_UEP0:
          if (intst & USBFS_UIS_TOG_OK) {
            if ((USBFS_SetupReqType & USB_REQ_TYP_MASK) !=
                USB_REQ_TYP_STANDARD) {
              if ((USBFS_SetupReqType & USB_REQ_TYP_MASK) ==
                  USB_REQ_TYP_CLASS) {
                switch (USBFS_SetupReqCode) {
                case HID_SET_REPORT:
                  USBFS_SetupReqLen = 0;
                  break;
                default:
                  break;
                }
              }
            } else {
              /* Standard request end-point 0 Data download */
              /* Add your code here */
            }
          }
          if (USBFS_SetupReqLen == 0) {
            USBFSD->UEP0_TX_LEN = 0;
            USBFSD->UEP0_CTRL_H =
                (USBFSD->UEP0_CTRL_H & ~USBFS_UEP_T_RES_MASK) |
                USBFS_UEP_T_TOG | USBFS_UEP_T_RES_ACK;
          }
          break;

        default:
          break;
        }
        break;

      /* Setup stage processing */
      case USBFS_UIS_TOKEN_SETUP:
        USBFSD->UEP0_CTRL_H = USBFS_UEP_T_TOG | USBFS_UEP_T_RES_NAK |
                              USBFS_UEP_R_TOG | USBFS_UEP_R_RES_NAK;

