lilindian16/RE_SWC_FW/lib/ch32_usbd/src/ch32x035_usbd.c
        /* Store All Setup Values */
        USBFS_SetupReqType  = pUSBFS_SetupReqPak->bRequestType;
        USBFS_SetupReqCode  = pUSBFS_SetupReqPak->bRequest;
        USBFS_SetupReqLen   = pUSBFS_SetupReqPak->wLength;
        USBFS_SetupReqValue = pUSBFS_SetupReqPak->wValue;
        USBFS_SetupReqIndex = pUSBFS_SetupReqPak->wIndex;
        len                 = 0;
        errflag             = 0;

        if ((USBFS_SetupReqType & USB_REQ_TYP_MASK) != USB_REQ_TYP_STANDARD) {
          if ((USBFS_SetupReqType & USB_REQ_TYP_MASK) == USB_REQ_TYP_CLASS) {
            /* Class Request */
            switch (USBFS_SetupReqCode) {
            case HID_SET_REPORT:
              break;

            case HID_SET_IDLE:
              if (USBFS_SetupReqIndex == 0x00) {
                USBFS_HidIdle[0] = (uint8_t)(USBFS_SetupReqValue >> 8);
              } else if (USBFS_SetupReqIndex == 0x01) {
                USBFS_HidIdle[1] = (uint8_t)(USBFS_SetupReqValue >> 8);
              } else {
                errflag = 0xFF;
              }
              break;

            case HID_SET_PROTOCOL:
              if (USBFS_SetupReqIndex == 0x00) {
                USBFS_HidProtocol[0] = (uint8_t)USBFS_SetupReqValue;
              } else if (USBFS_SetupReqIndex == 0x01) {
                USBFS_HidProtocol[1] = (uint8_t)USBFS_SetupReqValue;
              } else {
                errflag = 0xFF;
              }
              break;

            case HID_GET_IDLE:
              if (USBFS_SetupReqIndex == 0x00) {
                USBFS_EP0_4Buf[0] = USBFS_HidIdle[0];
                len               = 1;
              } else if (USBFS_SetupReqIndex == 0x01) {
                USBFS_EP0_4Buf[0] = USBFS_HidIdle[1];
                len               = 1;
              } else {
                errflag = 0xFF;
              }
              break;

            case HID_GET_PROTOCOL:
              if (USBFS_SetupReqIndex == 0x00) {
                USBFS_EP0_4Buf[0] = USBFS_HidProtocol[0];
                len               = 1;
              } else if (USBFS_SetupReqIndex == 0x01) {
                USBFS_EP0_4Buf[0] = USBFS_HidProtocol[1];
                len               = 1;
              } else {
                errflag = 0xFF;
              }
              break;

            default:
              errflag = 0xFF;
              break;
            }
          }
        } else {
          /* usb standard request processing */
          switch (USBFS_SetupReqCode) {
          /* get device/configuration/string/report/... descriptors */
          case USB_GET_DESCRIPTOR:
            switch ((uint8_t)(USBFS_SetupReqValue >> 8)) {
            /* get usb device descriptor */
            case USB_DESCR_TYP_DEVICE:
              pUSBFS_Descr = descriptor_config_ptr->device_descriptor;
              len          = descriptor_config_ptr->device_descriptor[0];
              break;

            /* get usb configuration descriptor */
            case USB_DESCR_TYP_CONFIG:
              pUSBFS_Descr = descriptor_config_ptr->config_descriptor;
              len = ((uint16_t)descriptor_config_ptr->config_descriptor[2] +
                     ((uint16_t)descriptor_config_ptr->config_descriptor[3]
                      << 8));
              break;

            /* get usb hid descriptor */
            case USB_DESCR_TYP_HID:
              if (USBFS_SetupReqIndex == 0x00) {
                pUSBFS_Descr = &descriptor_config_ptr->config_descriptor[18];
                len          = 9;
              }
              // else if (USBFS_SetupReqIndex == 0x01) {
              //   pUSBFS_Descr = &descriptor_config_ptr->config_descriptor[43];
              //   len          = 9;
              // }
              else {
                errflag = 0xFF;
              }
              break;

            /* get usb report descriptor */
            case USB_DESCR_TYP_REPORT:
              if (USBFS_SetupReqIndex == 0x00) {
                pUSBFS_Descr =
                    descriptor_config_ptr->consumer_report_descriptor;
                len = 0x27;
              } else {
                errflag = 0xFF;
              }
              break;

            /* get usb string descriptor */
            case USB_DESCR_TYP_STRING:
              switch ((uint8_t)(USBFS_SetupReqValue & 0xFF)) {
              /* Descriptor 0, Language descriptor */
              case DEF_STRING_DESC_LANG:
                pUSBFS_Descr = descriptor_config_ptr->language_descriptor;
                len          = descriptor_config_ptr->language_descriptor[0];
                break;

              /* Descriptor 1, Manufacturers String descriptor */
              case DEF_STRING_DESC_MANU:
                pUSBFS_Descr = descriptor_config_ptr->manufacturer_descriptor;
                len = descriptor_config_ptr->manufacturer_descriptor[0];
                break;

              /* Descriptor 2, Product String descriptor */
              case DEF_STRING_DESC_PROD:
                pUSBFS_Descr = descriptor_config_ptr->prod_info_descriptor;
                len          = descriptor_config_ptr->prod_info_descriptor[0];
                break;

              /* Descriptor 3, Serial-number String descriptor */
              case DEF_STRING_DESC_SERN:
                pUSBFS_Descr =
                    descriptor_config_ptr->serial_num_info_descriptor;
                len = descriptor_config_ptr->serial_num_info_descriptor[0];
                break;

              default:
                errflag = 0xFF;
                break;
              }
              break;

            default:
              errflag = 0xFF;
              break;
            }

            /* Copy Descriptors to Endp0 DMA buffer */
            if (USBFS_SetupReqLen > len) {
              USBFS_SetupReqLen = len;
            }
            len = (USBFS_SetupReqLen >= DEF_USBD_UEP0_SIZE) ? DEF_USBD_UEP0_SIZE
                                                            : USBFS_SetupReqLen;
            memcpy(USBFS_EP0_4Buf, pUSBFS_Descr, len);
            pUSBFS_Descr += len;
            break;

          /* Set usb address */
          case USB_SET_ADDRESS:
            USBFS_DevAddr = (uint8_t)(USBFS_SetupReqValue & 0xFF);
            break;

          /* Get usb configuration now set */
          case USB_GET_CONFIGURATION:
            USBFS_EP0_4Buf[0] = USBFS_DevConfig;
            if (USBFS_SetupReqLen > 1) {
              USBFS_SetupReqLen = 1;
            }
            break;

          /* Set usb configuration to use */
          case USB_SET_CONFIGURATION:
            USBFS_DevConfig     = (uint8_t)(USBFS_SetupReqValue & 0xFF);
            USBFS_DevEnumStatus = 0x01;
            break;

