lilindian16/RE_SWC_FW/lib/ch32_usbd/src/ch32x035_usbd.c
          /* Clear or disable one usb feature */
          case USB_CLEAR_FEATURE:
            if ((USBFS_SetupReqType & USB_REQ_RECIP_MASK) ==
                USB_REQ_RECIP_DEVICE) {
              /* clear one device feature */
              if ((uint8_t)(USBFS_SetupReqValue & 0xFF) ==
                  USB_REQ_FEAT_REMOTE_WAKEUP) {
                /* clear usb sleep status, device not prepare to sleep */
                USBFS_DevSleepStatus &= ~0x01;
              } else {
                errflag = 0xFF;
              }
            } else if ((USBFS_SetupReqType & USB_REQ_RECIP_MASK) ==
                       USB_REQ_RECIP_ENDP) {
              if ((uint8_t)(USBFS_SetupReqValue & 0xFF) ==
                  USB_REQ_FEAT_ENDP_HALT) {
                /* Clear End-point Feature */
                switch ((uint8_t)(USBFS_SetupReqIndex & 0xFF)) {
                case (DEF_UEP_IN | DEF_UEP1):
                  /* Set End-point 1 OUT ACK */
                  USBFSD->UEP1_CTRL_H = USBFS_UEP_T_RES_NAK;
                  break;

                case (DEF_UEP_IN | DEF_UEP2):
                  /* Set End-point 2 IN NAK */
                  USBFSD->UEP2_CTRL_H = USBFS_UEP_T_RES_NAK;
                  break;

                default:
                  errflag = 0xFF;
                  break;
                }
              } else {
                errflag = 0xFF;
              }
            } else {
              errflag = 0xFF;
            }
            break;

          /* set or enable one usb feature */
          case USB_SET_FEATURE:
            if ((USBFS_SetupReqType & USB_REQ_RECIP_MASK) ==
                USB_REQ_RECIP_DEVICE) {
              /* Set Device Feature */
              if ((uint8_t)(USBFS_SetupReqValue & 0xFF) ==
                  USB_REQ_FEAT_REMOTE_WAKEUP) {
                if (descriptor_config_ptr->config_descriptor[7] & 0x20) {
                  /* Set Wake-up flag, device prepare to sleep */
                  USBFS_DevSleepStatus |= 0x01;
                } else {
                  errflag = 0xFF;
                }
              } else {
                errflag = 0xFF;
              }
            } else if ((USBFS_SetupReqType & USB_REQ_RECIP_MASK) ==
                       USB_REQ_RECIP_ENDP) {
              /* Set Endpoint Feature */
              if ((uint8_t)(USBFS_SetupReqValue & 0xFF) ==
                  USB_REQ_FEAT_ENDP_HALT) {
                switch ((uint8_t)(USBFS_SetupReqIndex & 0xFF)) {
                case (DEF_UEP_IN | DEF_UEP1):
                  USBFSD->UEP1_CTRL_H =
                      (USBFSD->UEP1_CTRL_H & ~USBFS_UEP_T_RES_MASK) |
                      USBFS_UEP_T_RES_STALL;
                  break;

                case (DEF_UEP_IN | DEF_UEP2):
                  USBFSD->UEP2_CTRL_H =
                      (USBFSD->UEP2_CTRL_H & ~USBFS_UEP_T_RES_MASK) |
                      USBFS_UEP_T_RES_STALL;
                  break;

                default:
                  errflag = 0xFF;
                  break;
                }
              } else {
                errflag = 0xFF;
              }
            } else {
              errflag = 0xFF;
            }
            break;

          /* This request allows the host to select another setting for the
           * specified interface  */
          case USB_GET_INTERFACE:
            USBFS_EP0_4Buf[0] = 0x00;
            if (USBFS_SetupReqLen > 1) {
              USBFS_SetupReqLen = 1;
            }
            break;

          case USB_SET_INTERFACE:
            break;

          /* host get status of specified device/interface/end-points */
          case USB_GET_STATUS:
            USBFS_EP0_4Buf[0] = 0x00;
            USBFS_EP0_4Buf[1] = 0x00;
            if ((USBFS_SetupReqType & USB_REQ_RECIP_MASK) ==
                USB_REQ_RECIP_DEVICE) {
              if (USBFS_DevSleepStatus & 0x01) {
                USBFS_EP0_4Buf[0] = 0x02;
              } else {
                USBFS_EP0_4Buf[0] = 0x00;
              }
            } else if ((USBFS_SetupReqType & USB_REQ_RECIP_MASK) ==
                       USB_REQ_RECIP_ENDP) {
              if ((uint8_t)(USBFS_SetupReqIndex & 0xFF) ==
                  (DEF_UEP_IN | DEF_UEP1)) {
                if ((USBFSD->UEP1_CTRL_H & USBFS_UEP_T_RES_MASK) ==
                    USBFS_UEP_T_RES_STALL) {
                  USBFS_EP0_4Buf[0] = 0x01;
                }
              } else if ((uint8_t)(USBFS_SetupReqIndex & 0xFF) ==
                         (DEF_UEP_IN | DEF_UEP2)) {
                if ((USBFSD->UEP2_CTRL_H & USBFS_UEP_T_RES_MASK) ==
                    USBFS_UEP_T_RES_STALL) {
                  USBFS_EP0_4Buf[0] = 0x01;
                }
              } else {
                errflag = 0xFF;
              }
            } else {
              errflag = 0xFF;
            }
            if (USBFS_SetupReqLen > 2) {
              USBFS_SetupReqLen = 2;
            }
            break;

          default:
            errflag = 0xFF;
            break;
          }
        }

        /* errflag = 0xFF means a request not support or some errors occurred,
         * else correct */
        if (errflag == 0xFF) {
          /* if one request not support, return stall */
          USBFSD->UEP0_CTRL_H = USBFS_UEP_T_TOG | USBFS_UEP_T_RES_STALL |
                                USBFS_UEP_R_TOG | USBFS_UEP_R_RES_STALL;
        } else {
          /* end-point 0 data Tx/Rx */
          if (USBFS_SetupReqType & DEF_UEP_IN) {
            len = (USBFS_SetupReqLen > DEF_USBD_UEP0_SIZE) ? DEF_USBD_UEP0_SIZE
                                                           : USBFS_SetupReqLen;
            USBFS_SetupReqLen -= len;
            USBFSD->UEP0_TX_LEN = len;
            USBFSD->UEP0_CTRL_H =
                (USBFSD->UEP0_CTRL_H & ~USBFS_UEP_T_RES_MASK) |
                USBFS_UEP_T_TOG | USBFS_UEP_T_RES_ACK;
          } else {
            if (USBFS_SetupReqLen == 0) {
              USBFSD->UEP0_TX_LEN = 0;
              USBFSD->UEP0_CTRL_H =
                  (USBFSD->UEP0_CTRL_H & ~USBFS_UEP_T_RES_MASK) |
                  USBFS_UEP_T_TOG | USBFS_UEP_T_RES_ACK;
            } else {
              USBFSD->UEP0_CTRL_H =
                  (USBFSD->UEP0_CTRL_H & ~USBFS_UEP_R_RES_MASK) |
                  USBFS_UEP_R_TOG | USBFS_UEP_R_RES_ACK;
            }
          }
        }
        break;

      /* Sof pack processing */
      case USBFS_UIS_TOKEN_SOF:
        break;

      default:
        break;
      }
      USBFSD->INT_FG = USBFS_UIF_TRANSFER;
    } else if (intflag & USBFS_UIF_BUS_RST) {
      /* usb reset interrupt processing */
      USBFS_DevConfig      = 0;
      USBFS_DevAddr        = 0;
      USBFS_DevSleepStatus = 0;
      USBFS_DevEnumStatus  = 0;

      USBFSD->DEV_ADDR = 0;
      USBFS_Device_Endp_Init();
      USBFSD->INT_FG = USBFS_UIF_BUS_RST;
    } else if (intflag & USBFS_UIF_SUSPEND) {
      USBFSD->INT_FG = USBFS_UIF_SUSPEND;
      delayMicroseconds(10);
      /* usb suspend interrupt processing */
      if (USBFSD->MIS_ST & USBFS_UMS_SUSPEND) {
        USBFS_DevSleepStatus |= 0x02;
        if (USBFS_DevSleepStatus == 0x03) {
          /* Handling usb sleep here */
          MCU_Sleep_Wakeup_Operate();
        }
      } else {
        USBFS_DevSleepStatus &= ~0x02;
      }
    } else {
      /* other interrupts */
      USBFSD->INT_FG = intflag;
    }
    break;

  default:
    break;
  }
}

bool is_endpoint_rx_pending(uint8_t endpoint) {
  if (endpoint <= DEF_UEP_NUM - 1) // Endpoint index starts at 0
  {
    return endpoint_rx_pending[endpoint];
  }
  return false;
}

uint8_t get_endpoint_rx_message(uint8_t endpoint, uint8_t *buffer,
                                size_t buffer_length) {
  /* Alert the system there is data waiting on endpoint */
  size_t   len = USBFSD->RX_LEN;
  uint8_t *endpoint_buffer_ptr;
  switch (endpoint) {
  case 2:
    endpoint_buffer_ptr = USBFS_EP2_Buf;
    break;
  default:
    break;
  }
  if (len <= buffer_length) {
    memcpy(buffer, endpoint_buffer_ptr, len);
  }
  endpoint_rx_pending[endpoint] = false;
  return len;
}

bool is_endpoint_tx_pending(uint8_t endpoint) {
  return USBFS_Endp_Busy[endpoint];
}